{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. \n",
    "# За один ход игрок может добавить в одну из куч (по своему выбору) один камень или увеличить количество камней в куче в два раза. \n",
    "# Например, пусть в одной куче 10 камней, а в другой 5 камней; такую позицию в игре будем обозначать (10, 5). \n",
    "# Тогда за один ход можно получить любую из четырёх позиций: (11, 5), (20, 5), (10, 6), (10, 10). \n",
    "# Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.\n",
    "# Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 77. \n",
    "# Победителем считается игрок, сделавший последний ход, то есть первым получивший такую позицию, при которой в кучах будет 77 или больше камней.\n",
    "# В начальный момент в первой куче было семь камней, во второй куче  — S камней; 1 ≤ S ≤ 69.\n",
    "# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. \n",
    "# Описать стратегию игрока  — значит, описать, какой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника. \n",
    "# В описание выигрышной стратегии не следует включать ходы играющего по этой стратегии игрока, не являющиеся для него безусловно выигрышными, \n",
    "# то есть не являющиеся выигрышными независимо от игры противника.\n",
    "\n",
    "# 19) Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.\n",
    "\n",
    "# 20) Найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:\n",
    "# —  Петя не может выиграть за один ход;\n",
    "# —  Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.\n",
    "\n",
    "# 3) Найдите минимальное значение S, при котором одновременно выполняются два условия:\n",
    "# —  у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;\n",
    "# —  у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.\n",
    "\n",
    "# сумма >= 77\n",
    "# +1 *2 (7, S)\n",
    "\n",
    "def v1(a, b):\n",
    "    return ((a+1+b>=77) or (a*2+b>=77) or (a+1+b>=77) or (a+2*b>=77)) and a<=69 and b<=69\n",
    "def p1(a, b):\n",
    "    return v1(a+1, b) and v1(a, b+1) and v1(a*2, b) and v1(a, b*2) and not(v1(a,b))\n",
    "def v2(a, b):\n",
    "    return p1(a+1, b) or p1(a, b+1) or p1(a*2, b) or p1(a, b*2) and not(v1(a,b))\n",
    "def p2(a, b):                                                                                      #21\n",
    "    return (v2(a, b*2) or v2(a, b+1) or v2(a+1, b) or v2(a*2, b)) and (v1(a+1, b) or v2(a+1, b)) and (v1(a, b+1) or v2(a, b+1)) and (v1(a*2, b) or v2(a*2, b)) and (v1(a, b*2) or v2(a, b*2)) and not(v1(a,b))\n",
    "\n",
    "for s in range(1, 70, 1):\n",
    "    if p2(7, s) == 1:\n",
    "        print(s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. \n",
    "# Игроки ходят по очереди, первый ход делает Петя. \n",
    "# За один ход игрок может добавить в кучу один или четыре камня либо увеличить количество камней в куче в пять раз. \n",
    "# Например, имея кучу из 15 камней, за один ход можно получить кучу из 16, 19 или 75 камней. \n",
    "# У каждого игрока, чтобы делать ходы, есть неограниченное количество камней. И\n",
    "# гра завершается в тот момент, когда количество камней в куче становится не менее 68.\n",
    "\n",
    "# Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 68 или больше камней. \n",
    "# В начальный момент в куче было S камней; 1 ≤ S ≤ 67.\n",
    "\n",
    "# Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. \n",
    "# Описать стратегию игрока  — значит, описать, какой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника. \n",
    "# В описание выигрышной стратегии не следует включать ходы играющего по этой стратегии игрока, не являющиеся для него безусловно выигрышными, \n",
    "# то есть не являющиеся выигрышными независимо от игры противника.\n",
    "\n",
    "# 19) Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.\n",
    "\n",
    "# 20) Найдите два таких значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:\n",
    "# —  Петя не может выиграть за один ход;\n",
    "# —  Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.\n",
    "\n",
    "# 21) Найдите минимальное значение S, при котором одновременно выполняются два условия:\n",
    "# —  у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;\n",
    "# —  у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.\n",
    "\n",
    "\n",
    "# >= 68   +1 + 4 *5\n",
    "\n",
    "def v1(s):\n",
    "    return (s+1>=68 or s+4>=68 or s*5>=68) and s<=67\n",
    "def p1(s):\n",
    "    return v1(s+1) and v1(s+4) and v1(s*5) and not(v1(s))\n",
    "def v2(s):\n",
    "    return (p1(s+1) or p1(s+4) or p1(s*5)) and not(v1(s))\n",
    "def p2(s):                                             # 21\n",
    "    return (v2(s+1) or v2(s+4) or v2(s*5)) and (v2(s+1) or v1(s+1)) and (v2(s+4) or v1(s+4)) and (v2(s*5) or v1(s*5)) and not(v1(s))\n",
    "\n",
    "\n",
    "for s in range(1, 68):                                 # 20\n",
    "    if v2(s) == 1:\n",
    "        print(20, s)\n",
    "\n",
    "for s in range(1, 68):                                 # 21\n",
    "    if p2(s) == 1:\n",
    "        print(21, s)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.10.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
